Repository: Apilot16/Tor-Manager
Catalog: Locale.*.resx
Languages: ru

# ErrorGlobal
source: Error: {0} Type: {1} Message: {2} Challenging Flax: {3}
ru: Ошибка: {0} Тип: {1} Сообщение: {2} Стек вызовов: {3}

# TorRunning
source: Tor is already running.
ru: Tor уже запущен.

# NotFoundFileTor
source: File along the path "{0}" was not found
ru: Файл по пути "{0}" не найден

# TorExited
source: Tor the process is completed.
ru: Tor процесс завершен.

# ErrorLaunchTor
source: Tor launch error:
ru: Ошибка запуска тор:

# TorKilled
source: Tor is completed.
ru: Tor завершён.

# ErrorStopingTor
source: The error of stopping Tor
ru: Ошибка остановки тор

# ByPass
source: By password
ru: по паролю

source: By cookie
ru: по cookie

# SuccessfullAuthenticationNoPass
source: Authentication without a password was successful.
ru: Аутентификация без пароля прошла успешно.

# ErrorAuthenticationNoPass
source: Authentication error without password:
ru: Ошибка аутентификации без проля:

# ErrorConnecting
source: Connection error:
ru: Ошибка подключения:

# ClosedConnectionTor
source: The connection with Tor is closed.
ru: Соединение с Tor закрыто.

# ErrorDisconnect
source: Backage Error: {0}
ru: Ошибка при отключении: {0}

# SuccessfullAuthentication
source: Authentication {0} was successful.
ru: Аутентификация {0} прошла успешно.

# ErrorAuthenticationMetodResponse
source: Authentication error {0}: {1}
ru: Ошибка аутентификации {0}: {1}

# ErrorAuthenticationMetod
source: Authentication error {0}
ru: Ошибка аутентификации {0}

# ErrorLaunchCommand
source: Error when performing a command: {0}
ru: Ошибка при выполнении команды: {0}

# ReadedBytes
source: Read {0} byte: {1}
ru: Прочитано {0} байт: {1}

# NotFoundTorProcess
source: The Tor process was not found.
ru: Процесс Tor не найден.

# FoundControlPortInArguments
source: Found ControlPort in the launch arguments: {0}
ru: Найден ControlPort в аргументах запуска: {0}

# FoundDataDirectoryInArguments
source: Found DataDirectory in launch arguments: {0}
ru: Найдена DataDirectory в аргументах запуска: {0}

# FoundListenPort
source: Found the listener of the port: {0}
ru: Найден слушающий порт: {0}

# Foundcontrol_auth_cookie
source: Found Control_auth_cookie: {0}
ru: Найден control_auth_cookie: {0}

# NotFoundControl_auth_cookie
source: Control_auth_cookie file was not found.
ru: Файл control_auth_cookie не найден.

# ControlPortFromTorrc
source: Controlport from Torrc: {0}
ru: ControlPort из torrc: {0}

# ErrorAnalysetorrc
source: Error in analyzing the torrc file: {0}
ru: Ошибка при анализе файла torrc: {0}

# NotFoundtorrc
source: Torrc file was not found. The default port is used.
ru: Файл torrc не найден. Используется порт по умолчанию.

# ConfirmedControlPort
source: Confirmed ControlPort: {0}
ru: Подтверждён ControlPort: {0}

# NotConfirmedControlPort
source: ControlPort is not confirmed among the listening ports.
ru: ControlPort не подтверждён среди слушающих портов.

# DifferentsInDataDirectory
source: Different values of DataDirectory from different sources were found.
ru: Обнаружены различные значения DataDirectory из разных источников.

# ConfirmedDataDirectory
source: Confirmed DataDirectory {0}
ru: Подтверждён DataDirectory {0}

# ErrorGrabbingTorInfo
source: Error when collecting information about the Tor process: {0} {1}
ru: Ошибка при сборе информации о процессе Tor: {0} {1}

source: Answer:
ru: Ответ:

source: Connect?
ru: Подключиться?

# CookieFilter
source: CookieFile (control_auth_cookie)|control_auth_cookie| All files (*.*) |*.*
ru: Куки файл (control_auth_cookie)|control_auth_cookie|Все файлы (*.*)|*.*

# CookieTitle
source: Find and choose Control_auth_cookie File
ru: Найди и выбери control_auth_cookie файл

source: Error:
ru: Ошибка:

# Error2
source: Error
ru: Ошибка

# ErrorChoise
source: Choice error
ru: Ошибка выбора

# ErrorClose
source: Error when closing the application: {0}
ru: Ошибка при закрытии приложения: {0}

# ErrorCloseCl
source: Error when closing the application: {0} Close?
ru: Ошибка при закрытии приложения: {0} Закрыть?

# FileWrong
source: The file is chosen not true
ru: Файл выбран не верно

# FoundRunningTor
source: Found a neglected Tor Try to connect?
ru: Найден запущенный tor Попробовать подключиться?

# SetPort
source: The control port is changed to: {0}
ru: Управляющий порт изменён на:{0}

# TorBoxFilter
source: App (*.exe)|*.exe|All files (*.*) |*.*
ru: Приложение (*.exe)|*.exe|Все файлы (*.*)|*.*

# TorBoxTitle
source: Find and choose a tor.exe file
ru: Найди и выбери tor.exe файл

# TorDisconnected
source: Tor is disabled
ru: Tor отключён

# TorNotRunning
source: Tor is not launched
ru: Тор не запущен

# TorNotStarted
source: Tor did not start.
ru: Тор не запустился.

source: Tor started.
ru: Тор запустился.

# TorStartedAndConnected
source: Tor is launched and connected.
ru: Tor запущен и подключен.
